graphite-server/internal/analysis/c4/testdata/checkout-limit-1/context.mermaid
graph TD
    subgraph actors["Actors"]
        person_http_clients([HTTP Clients])
    end
    subgraph application["Application Layer"]
        system_application[[Checkout]]
    end
    subgraph external_systems["External Systems"]
        dependency_namespace_com_partner_payment["payment"]
    end
    system_application -->|uses| dependency_namespace_com_partner_payment
    person_http_clients -->|uses| system_application
