graphite-server/internal/analysis/c4/testdata/checkout-limit-1/context.plantuml
@startuml
top to bottom direction
skinparam shadowing false
actor "HTTP Clients" as person_http_clients
package "Application Layer" {
  rectangle "Checkout" as system_application
}
package "External Systems" {
  component "payment" as dependency_namespace_com_partner_payment
}
system_application --> dependency_namespace_com_partner_payment : uses
person_http_clients --> system_application : uses
@enduml
